This section explains how you can configure the various hosts (connected to switches and routers) in your mini-Internet.

#### Naming conventions

The interface to the router is called 
`<router-name>router`, e.g. `PITTrouter` for `PITT`. The loopback interface 
has the name `lo`.

#### Reading the configuration

You can see the interfaces with `ip address show`.

#### Changing the configuration

The host configuration is rather simple. First, you have to assign
an IP address and subnet to one of the interfaces available on the host.
For that, you can use the following command:

```
> ip address add IP/SUBNET_SIZE dev INTERFACENAME
```

For example, with

```
> ip address add 111.0.222.3/24 dev NEWYrouter
```

you assign the IP address `111.0.222.3` inside the corresponding /24 subnet
to the interface called `NEWYrouter`. Note that we configure the IP address
and the corresponding subnet all at once. To remove an IP address, you can use the following command:

```
> ip address del 111.0.222.3/24 dev NEWYrouter
```

At this point, the host knows how it can reach all the IP addresses inside the
subnet `111.0.222.0/24`. Unfortunately, we cannot reach any other IP.
(The subnet declaration tells the host in what subnet it is; the IP address in 
turn is the address by which other devices can reach this host).
Hence, you normally add a route towards a default gateway that the host uses to reach
all unknown IP addresses. To do that, use the command:

```
> ip route add default via IP_ADDRESS
```

> The commands are identical for IPv6

Coming back to our previous example, to add a route towards the router (connected to the
Internet) with IP address `111.0.222.1`, we could use the following command:

```
> ip route add default via 111.0.222.1
```

To see the current default gateway, use 

```
> netstat -rn
```

To delete past entries, use 

```
> ip route del default via IP_ADDRESS